# RebarShapeConstraintDiameter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintDiameter Class
Members See Also
---
A diameter constraint associated with an arc in a RebarShapeDefinition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintDiameter : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintDiameter _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintDiameter : public RebarShapeConstraint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintDiameter
# See Also
RebarShapeConstraintDiameter Members
Autodesk.Revit.DB.Structure Namespace